results/ycsb-results-mssqlnotok/mongodb/b/rc1000-op1000/tc12/run3.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.AsyncMongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27023 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadb -p recordcount=1000 -threads 12 -p operationcount=1000
mongo connection created with mongodb://172.16.13.26:27023
[OVERALL], RunTime(ms), 164
[OVERALL], Throughput(ops/sec), 6097.5609756097565
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 7
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 4.2682926829268295
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 4.2682926829268295
[READ], Operations, 955
[READ], AverageLatency(us), 1401.8701570680628
[READ], MinLatency(us), 122
[READ], MaxLatency(us), 36799
[READ], 95thPercentileLatency(us), 3107
[READ], 99thPercentileLatency(us), 35743
[READ], Return=OK, 955
[CLEANUP], Operations, 12
[CLEANUP], AverageLatency(us), 276.25
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 3303
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 3303
[UPDATE], Operations, 45
[UPDATE], AverageLatency(us), 1754.4666666666667
[UPDATE], MinLatency(us), 431
[UPDATE], MaxLatency(us), 19871
[UPDATE], 95thPercentileLatency(us), 3435
[UPDATE], 99thPercentileLatency(us), 19871
[UPDATE], Return=OK, 45